000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИменаЛюдей/ИменаЛюдей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИменаЛюдей</name>
  <attributes>
    <name>НаименованиеЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеУкраинское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеУкраинскоеЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпределяетПол</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектыПроблемныеДоВыяснения/ОбъектыПроблемныеДоВыяснения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыПроблемныеДоВыяснения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовДоВыяснения</types>
    </type>
  </resources>
  <resources>
    <name>Источник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МоментСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Альтернатива</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>DocumentRef.КорректировкаПеремещения</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <comment>Пустой - по всем магазинам</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыОбъектовДоВыяснения/СтатусыОбъектовДоВыяснения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбъектовДоВыяснения</name>
  <enumValues>
    <name>Обычный</name>
  </enumValues>
  <enumValues>
    <name>Контроль</name>
  </enumValues>
  <enumValues>
    <name>CRM</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИменаЛюдей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Поля.Добавить("Ссылка");
	Поля.Добавить("Наименование");
	Поля.Добавить("НаименованиеУкраинское");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если ОбщегоНазначенияРТповтИсп.ПолучитьУчетнуюПолитику().ИспользоватьУкраинскоеНаименование Тогда

			Представление = СокрЛП(Данные.НаименованиеУкраинское);

	Иначе	Представление = СокрЛП(Данные.Наименование);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

//	LNK 30.01.2019 14:32:34
Функция ИмяКорректно(Имя, Пол = Неопределено, Ссылка = Неопределено)	Экспорт

	Если ПустаяСтрока(Имя) Тогда

		Корректно = Истина;	//	LNK 08.02.2019 09:26:19 - на нет и суда нет

	Иначе

		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТаблицаСправочник.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИменаЛюдей КАК ТаблицаСправочник
		|ГДЕ
		|	(ТаблицаСправочник.Наименование = &Имя
		|			ИЛИ ТаблицаСправочник.НаименованиеУкраинское = &Имя)
		|	И НЕ ТаблицаСправочник.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &Пол = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТаблицаСправочник.Пол = &Пол
		|		КОНЕЦ"
		);
		Запрос.УстановитьПараметр("Имя", ТРег(СокрЛП(Имя)));
		Запрос.УстановитьПараметр("Пол", Пол);

		Результат = Запрос.Выполнить();
		Корректно = НЕ Результат.Пустой();

		Если НЕ Корректно И НЕ Ссылка = Неопределено И ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

			Если НЕ КонтактнаяИнформацияКлиентСервер.ЭтоПустоеНаименование(Имя) Тогда

				Если НЕ ПривилегированныйРежим() Тогда

					УстановитьПривилегированныйРежим(Истина);

				КонецЕсли;

				КлючиЗаписи = Новый Структура(
					"Объект, Магазин, Статус, Источник, Комментарий"
					, Ссылка
					, ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин
					, Перечисления.СтатусыОбъектовДоВыяснения.Обычный
					, "ФИОФизЛиц"
					, "Имя «" + Запрос.Параметры.Имя + "» не найдено в справочнике."
				);

				Если НЕ РегистрыСведений.ОбъектыПроблемныеДоВыяснения.ЗаписьСуществует(КлючиЗаписи) Тогда

					МенеджерЗаписи = РегистрыСведений.ОбъектыПроблемныеДоВыяснения.СоздатьМенеджерЗаписи();

					МенеджерЗаписи.Период   = ТекущаяДата();
					МенеджерЗаписи.Объект   = КлючиЗаписи.Объект;
					МенеджерЗаписи.Магазин  = КлючиЗаписи.Магазин;

					МенеджерЗаписи.Статус   = КлючиЗаписи.Статус;
					МенеджерЗаписи.Источник = КлючиЗаписи.Источник;
					МенеджерЗаписи.МоментСоздания = ОбщегоНазначенияКлиентСервер.УникальныйИдентификаторВремя(Ссылка.УникальныйИдентификатор());

					МенеджерЗаписи.Комментарий = КлючиЗаписи.Комментарий;

					МенеджерЗаписи.Записать();

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Возврат Корректно;

КонецФункции

//	LNK 12.06.2019 13:32:03
Функция ПолучитьДанныеВыбораИмени(Текст, Пол, ВернутьСсылки = Ложь)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 15
	|	ИменаЛюдей.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУкраинскоеНаименование = ИСТИНА
	|				И НЕ ИменаЛюдей.НаименованиеУкраинское = """"
	|			ТОГДА ИменаЛюдей.НаименованиеУкраинское
	|		ИНАЧЕ ИменаЛюдей.Наименование
	|	КОНЕЦ КАК Наименование
	|ИЗ
	|	Справочник.ИменаЛюдей КАК ИменаЛюдей
	|ГДЕ
	|	(ИменаЛюдей.Наименование ПОДОБНО &Текст
	|			ИЛИ ИменаЛюдей.НаименованиеУкраинское ПОДОБНО &Текст)
	|	И ИменаЛюдей.Пол = &Пол
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование"
	);
	Запрос.УстановитьПараметр("Текст", Текст + "%");
	Запрос.УстановитьПараметр("Пол"  , Пол);
	Запрос.УстановитьПараметр("ИспользоватьУкраинскоеНаименование", ОбщегоНазначенияРТповтИсп.ПолучитьУчетнуюПолитику().ИспользоватьУкраинскоеНаименование);
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(?(ВернутьСсылки = Истина, "Ссылка", "Наименование")));
	
	Возврат СписокЗначений;

КонецФункции

#КонецЕсли
